SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/MGM27/Include/mgm27_dcdc.h
/* Bit fields for DCDC EM01CTRL0 */
#define _DCDC_EM01CTRL0_RESETVALUE                    0x00000109UL                                    /**< Default value for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_MASK                          0x0000030FUL                                    /**< Mask for DCDC_EM01CTRL0                     */
#define _DCDC_EM01CTRL0_IPKVAL_SHIFT                  0                                               /**< Shift value for DCDC_IPKVAL                 */
#define _DCDC_EM01CTRL0_IPKVAL_MASK                   0xFUL                                           /**< Bit mask for DCDC_IPKVAL                    */
#define _DCDC_EM01CTRL0_IPKVAL_DEFAULT                0x00000009UL                                    /**< Mode DEFAULT for DCDC_EM01CTRL0             */
#define _DCDC_EM01CTRL0_IPKVAL_Load36mA               0x00000003UL                                    /**< Mode Load36mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load40mA               0x00000004UL                                    /**< Mode Load40mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load44mA               0x00000005UL                                    /**< Mode Load44mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load48mA               0x00000006UL                                    /**< Mode Load48mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load52mA               0x00000007UL                                    /**< Mode Load52mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load56mA               0x00000008UL                                    /**< Mode Load56mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load60mA               0x00000009UL                                    /**< Mode Load60mA for DCDC_EM01CTRL0            */
#define DCDC_EM01CTRL0_IPKVAL_DEFAULT                 (_DCDC_EM01CTRL0_IPKVAL_DEFAULT << 0)           /**< Shifted mode DEFAULT for DCDC_EM01CTRL0     */
#define DCDC_EM01CTRL0_IPKVAL_Load36mA                (_DCDC_EM01CTRL0_IPKVAL_Load36mA << 0)          /**< Shifted mode Load36mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load40mA                (_DCDC_EM01CTRL0_IPKVAL_Load40mA << 0)          /**< Shifted mode Load40mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load44mA                (_DCDC_EM01CTRL0_IPKVAL_Load44mA << 0)          /**< Shifted mode Load44mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load48mA                (_DCDC_EM01CTRL0_IPKVAL_Load48mA << 0)          /**< Shifted mode Load48mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load52mA                (_DCDC_EM01CTRL0_IPKVAL_Load52mA << 0)          /**< Shifted mode Load52mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load56mA                (_DCDC_EM01CTRL0_IPKVAL_Load56mA << 0)          /**< Shifted mode Load56mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load60mA                (_DCDC_EM01CTRL0_IPKVAL_Load60mA << 0)          /**< Shifted mode Load60mA for DCDC_EM01CTRL0    */
#define _DCDC_EM01CTRL0_DRVSPEED_SHIFT                8                                               /**< Shift value for DCDC_DRVSPEED               */
#define _DCDC_EM01CTRL0_DRVSPEED_MASK                 0x300UL                                         /**< Bit mask for DCDC_DRVSPEED                  */
#define _DCDC_EM01CTRL0_DRVSPEED_DEFAULT              0x00000001UL                                    /**< Mode DEFAULT for DCDC_EM01CTRL0             */
#define _DCDC_EM01CTRL0_DRVSPEED_DEFAULT_SETTING      0x00000001UL                                    /**< Mode DEFAULT_SETTING for DCDC_EM01CTRL0     */
#define DCDC_EM01CTRL0_DRVSPEED_DEFAULT               (_DCDC_EM01CTRL0_DRVSPEED_DEFAULT << 8)         /**< Shifted mode DEFAULT for DCDC_EM01CTRL0     */
#define DCDC_EM01CTRL0_DRVSPEED_DEFAULT_SETTING       (_DCDC_EM01CTRL0_DRVSPEED_DEFAULT_SETTING << 8) /**< Shifted mode DEFAULT_SETTING for DCDC_EM01CTRL0*/

/* Bit fields for DCDC EM23CTRL0 */
#define _DCDC_EM23CTRL0_RESETVALUE                    0x00000103UL                                    /**< Default value for DCDC_EM23CTRL0            */
#define _DCDC_EM23CTRL0_MASK                          0x0000030FUL                                    /**< Mask for DCDC_EM23CTRL0                     */
#define _DCDC_EM23CTRL0_IPKVAL_SHIFT                  0                                               /**< Shift value for DCDC_IPKVAL                 */
#define _DCDC_EM23CTRL0_IPKVAL_MASK                   0xFUL                                           /**< Bit mask for DCDC_IPKVAL                    */
#define _DCDC_EM23CTRL0_IPKVAL_DEFAULT                0x00000003UL                                    /**< Mode DEFAULT for DCDC_EM23CTRL0             */
#define _DCDC_EM23CTRL0_IPKVAL_Load5mA                0x00000003UL                                    /**< Mode Load5mA for DCDC_EM23CTRL0             */
#define _DCDC_EM23CTRL0_IPKVAL_Load10mA               0x00000009UL                                    /**< Mode Load10mA for DCDC_EM23CTRL0            */
#define DCDC_EM23CTRL0_IPKVAL_DEFAULT                 (_DCDC_EM23CTRL0_IPKVAL_DEFAULT << 0)           /**< Shifted mode DEFAULT for DCDC_EM23CTRL0     */
#define DCDC_EM23CTRL0_IPKVAL_Load5mA                 (_DCDC_EM23CTRL0_IPKVAL_Load5mA << 0)           /**< Shifted mode Load5mA for DCDC_EM23CTRL0     */
#define DCDC_EM23CTRL0_IPKVAL_Load10mA                (_DCDC_EM23CTRL0_IPKVAL_Load10mA << 0)          /**< Shifted mode Load10mA for DCDC_EM23CTRL0    */
#define _DCDC_EM23CTRL0_DRVSPEED_SHIFT                8                                               /**< Shift value for DCDC_DRVSPEED               */
#define _DCDC_EM23CTRL0_DRVSPEED_MASK                 0x300UL                                         /**< Bit mask for DCDC_DRVSPEED                  */
#define _DCDC_EM23CTRL0_DRVSPEED_DEFAULT              0x00000001UL                                    /**< Mode DEFAULT for DCDC_EM23CTRL0             */
#define _DCDC_EM23CTRL0_DRVSPEED_DEFAULT_SETTING      0x00000001UL                                    /**< Mode DEFAULT_SETTING for DCDC_EM23CTRL0     */
#define DCDC_EM23CTRL0_DRVSPEED_DEFAULT               (_DCDC_EM23CTRL0_DRVSPEED_DEFAULT << 8)         /**< Shifted mode DEFAULT for DCDC_EM23CTRL0     */
#define DCDC_EM23CTRL0_DRVSPEED_DEFAULT_SETTING       (_DCDC_EM23CTRL0_DRVSPEED_DEFAULT_SETTING << 8) /**< Shifted mode DEFAULT_SETTING for DCDC_EM23CTRL0*/

/* Bit fields for DCDC BSTCTRL */
#define _DCDC_BSTCTRL_RESETVALUE                      0x00000047UL                                 /**< Default value for DCDC_BSTCTRL              */
#define _DCDC_BSTCTRL_MASK                            0x00000077UL                                 /**< Mask for DCDC_BSTCTRL                       */
#define _DCDC_BSTCTRL_BSTTOFFMAX_SHIFT                0                                            /**< Shift value for DCDC_BSTTOFFMAX             */
#define _DCDC_BSTCTRL_BSTTOFFMAX_MASK                 0x7UL                                        /**< Bit mask for DCDC_BSTTOFFMAX                */
#define _DCDC_BSTCTRL_BSTTOFFMAX_DEFAULT              0x00000007UL                                 /**< Mode DEFAULT for DCDC_BSTCTRL               */
#define _DCDC_BSTCTRL_BSTTOFFMAX_OFF                  0x00000000UL                                 /**< Mode OFF for DCDC_BSTCTRL                   */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P35us          0x00000001UL                                 /**< Mode TMAX_0P35us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P63us          0x00000002UL                                 /**< Mode TMAX_0P63us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P91us          0x00000003UL                                 /**< Mode TMAX_0P91us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P19us          0x00000004UL                                 /**< Mode TMAX_1P19us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P47us          0x00000005UL                                 /**< Mode TMAX_1P47us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P75us          0x00000006UL                                 /**< Mode TMAX_1P75us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_2P03us          0x00000007UL                                 /**< Mode TMAX_2P03us for DCDC_BSTCTRL           */
#define DCDC_BSTCTRL_BSTTOFFMAX_DEFAULT               (_DCDC_BSTCTRL_BSTTOFFMAX_DEFAULT << 0)      /**< Shifted mode DEFAULT for DCDC_BSTCTRL       */
#define DCDC_BSTCTRL_BSTTOFFMAX_OFF                   (_DCDC_BSTCTRL_BSTTOFFMAX_OFF << 0)          /**< Shifted mode OFF for DCDC_BSTCTRL           */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P35us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P35us << 0)  /**< Shifted mode TMAX_0P35us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P63us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P63us << 0)  /**< Shifted mode TMAX_0P63us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P91us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P91us << 0)  /**< Shifted mode TMAX_0P91us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P19us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P19us << 0)  /**< Shifted mode TMAX_1P19us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P47us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P47us << 0)  /**< Shifted mode TMAX_1P47us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P75us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P75us << 0)  /**< Shifted mode TMAX_1P75us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_2P03us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_2P03us << 0)  /**< Shifted mode TMAX_2P03us for DCDC_BSTCTRL   */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_SHIFT               4                                            /**< Shift value for DCDC_IPKTMAXCTRL            */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_MASK                0x70UL                                       /**< Bit mask for DCDC_IPKTMAXCTRL               */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_DEFAULT             0x00000004UL                                 /**< Mode DEFAULT for DCDC_BSTCTRL               */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_OFF                 0x00000000UL                                 /**< Mode OFF for DCDC_BSTCTRL                   */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P35us         0x00000001UL                                 /**< Mode TMAX_0P35us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P63us         0x00000002UL                                 /**< Mode TMAX_0P63us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P91us         0x00000003UL                                 /**< Mode TMAX_0P91us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P19us         0x00000004UL                                 /**< Mode TMAX_1P19us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P47us         0x00000005UL                                 /**< Mode TMAX_1P47us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P75us         0x00000006UL                                 /**< Mode TMAX_1P75us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_2P03us         0x00000007UL                                 /**< Mode TMAX_2P03us for DCDC_BSTCTRL           */
#define DCDC_BSTCTRL_IPKTMAXCTRL_DEFAULT              (_DCDC_BSTCTRL_IPKTMAXCTRL_DEFAULT << 4)     /**< Shifted mode DEFAULT for DCDC_BSTCTRL       */
#define DCDC_BSTCTRL_IPKTMAXCTRL_OFF                  (_DCDC_BSTCTRL_IPKTMAXCTRL_OFF << 4)         /**< Shifted mode OFF for DCDC_BSTCTRL           */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P35us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P35us << 4) /**< Shifted mode TMAX_0P35us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P63us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P63us << 4) /**< Shifted mode TMAX_0P63us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P91us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P91us << 4) /**< Shifted mode TMAX_0P91us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P19us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P19us << 4) /**< Shifted mode TMAX_1P19us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P47us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P47us << 4) /**< Shifted mode TMAX_1P47us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P75us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P75us << 4) /**< Shifted mode TMAX_1P75us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_2P03us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_2P03us << 4) /**< Shifted mode TMAX_2P03us for DCDC_BSTCTRL   */

/* Bit fields for DCDC BSTEM01CTRL */
#define _DCDC_BSTEM01CTRL_RESETVALUE                  0x0000010DUL                                      /**< Default value for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_MASK                        0x0000030FUL                                      /**< Mask for DCDC_BSTEM01CTRL                   */
#define _DCDC_BSTEM01CTRL_IPKVAL_SHIFT                0                                                 /**< Shift value for DCDC_IPKVAL                 */
#define _DCDC_BSTEM01CTRL_IPKVAL_MASK                 0xFUL                                             /**< Bit mask for DCDC_IPKVAL                    */
#define _DCDC_BSTEM01CTRL_IPKVAL_DEFAULT              0x0000000DUL                                      /**< Mode DEFAULT for DCDC_BSTEM01CTRL           */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load10mA             0x00000004UL                                      /**< Mode Load10mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load11mA             0x00000005UL                                      /**< Mode Load11mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load13mA             0x00000006UL                                      /**< Mode Load13mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load15mA             0x00000007UL                                      /**< Mode Load15mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load16mA             0x00000008UL                                      /**< Mode Load16mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load18mA             0x00000009UL                                      /**< Mode Load18mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load20mA             0x0000000AUL                                      /**< Mode Load20mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load21mA             0x0000000BUL                                      /**< Mode Load21mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load23mA             0x0000000CUL                                      /**< Mode Load23mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load25mA             0x0000000DUL                                      /**< Mode Load25mA for DCDC_BSTEM01CTRL          */
#define _DCDC_BSTEM01CTRL_IPKVAL_Load26mA             0x0000000EUL                                      /**< Mode Load26mA for DCDC_BSTEM01CTRL          */
#define DCDC_BSTEM01CTRL_IPKVAL_DEFAULT               (_DCDC_BSTEM01CTRL_IPKVAL_DEFAULT << 0)           /**< Shifted mode DEFAULT for DCDC_BSTEM01CTRL   */
#define DCDC_BSTEM01CTRL_IPKVAL_Load10mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load10mA << 0)          /**< Shifted mode Load10mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load11mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load11mA << 0)          /**< Shifted mode Load11mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load13mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load13mA << 0)          /**< Shifted mode Load13mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load15mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load15mA << 0)          /**< Shifted mode Load15mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load16mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load16mA << 0)          /**< Shifted mode Load16mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load18mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load18mA << 0)          /**< Shifted mode Load18mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load20mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load20mA << 0)          /**< Shifted mode Load20mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load21mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load21mA << 0)          /**< Shifted mode Load21mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load23mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load23mA << 0)          /**< Shifted mode Load23mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load25mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load25mA << 0)          /**< Shifted mode Load25mA for DCDC_BSTEM01CTRL  */
#define DCDC_BSTEM01CTRL_IPKVAL_Load26mA              (_DCDC_BSTEM01CTRL_IPKVAL_Load26mA << 0)          /**< Shifted mode Load26mA for DCDC_BSTEM01CTRL  */
#define _DCDC_BSTEM01CTRL_DRVSPEED_SHIFT              8                                                 /**< Shift value for DCDC_DRVSPEED               */
#define _DCDC_BSTEM01CTRL_DRVSPEED_MASK               0x300UL                                           /**< Bit mask for DCDC_DRVSPEED                  */
#define _DCDC_BSTEM01CTRL_DRVSPEED_DEFAULT            0x00000001UL                                      /**< Mode DEFAULT for DCDC_BSTEM01CTRL           */
#define _DCDC_BSTEM01CTRL_DRVSPEED_DEFAULT_SETTING    0x00000001UL                                      /**< Mode DEFAULT_SETTING for DCDC_BSTEM01CTRL   */
#define DCDC_BSTEM01CTRL_DRVSPEED_DEFAULT             (_DCDC_BSTEM01CTRL_DRVSPEED_DEFAULT << 8)         /**< Shifted mode DEFAULT for DCDC_BSTEM01CTRL   */
#define DCDC_BSTEM01CTRL_DRVSPEED_DEFAULT_SETTING     (_DCDC_BSTEM01CTRL_DRVSPEED_DEFAULT_SETTING << 8) /**< Shifted mode DEFAULT_SETTING for DCDC_BSTEM01CTRL*/

/* Bit fields for DCDC BSTEM23CTRL */
#define _DCDC_BSTEM23CTRL_RESETVALUE                  0x0000010AUL                                      /**< Default value for DCDC_BSTEM23CTRL          */
#define _DCDC_BSTEM23CTRL_MASK                        0x0000030FUL                                      /**< Mask for DCDC_BSTEM23CTRL                   */
#define _DCDC_BSTEM23CTRL_IPKVAL_SHIFT                0                                                 /**< Shift value for DCDC_IPKVAL                 */
#define _DCDC_BSTEM23CTRL_IPKVAL_MASK                 0xFUL                                             /**< Bit mask for DCDC_IPKVAL                    */
#define _DCDC_BSTEM23CTRL_IPKVAL_DEFAULT              0x0000000AUL                                      /**< Mode DEFAULT for DCDC_BSTEM23CTRL           */
#define _DCDC_BSTEM23CTRL_IPKVAL_Load5mA              0x00000004UL                                      /**< Mode Load5mA for DCDC_BSTEM23CTRL           */
#define _DCDC_BSTEM23CTRL_IPKVAL_Load10mA             0x0000000AUL                                      /**< Mode Load10mA for DCDC_BSTEM23CTRL          */
#define DCDC_BSTEM23CTRL_IPKVAL_DEFAULT               (_DCDC_BSTEM23CTRL_IPKVAL_DEFAULT << 0)           /**< Shifted mode DEFAULT for DCDC_BSTEM23CTRL   */
#define DCDC_BSTEM23CTRL_IPKVAL_Load5mA               (_DCDC_BSTEM23CTRL_IPKVAL_Load5mA << 0)           /**< Shifted mode Load5mA for DCDC_BSTEM23CTRL   */
#define DCDC_BSTEM23CTRL_IPKVAL_Load10mA              (_DCDC_BSTEM23CTRL_IPKVAL_Load10mA << 0)          /**< Shifted mode Load10mA for DCDC_BSTEM23CTRL  */
#define _DCDC_BSTEM23CTRL_DRVSPEED_SHIFT              8                                                 /**< Shift value for DCDC_DRVSPEED               */
#define _DCDC_BSTEM23CTRL_DRVSPEED_MASK               0x300UL                                           /**< Bit mask for DCDC_DRVSPEED                  */
#define _DCDC_BSTEM23CTRL_DRVSPEED_DEFAULT            0x00000001UL                                      /**< Mode DEFAULT for DCDC_BSTEM23CTRL           */
#define _DCDC_BSTEM23CTRL_DRVSPEED_DEFAULT_SETTING    0x00000001UL                                      /**< Mode DEFAULT_SETTING for DCDC_BSTEM23CTRL   */
#define DCDC_BSTEM23CTRL_DRVSPEED_DEFAULT             (_DCDC_BSTEM23CTRL_DRVSPEED_DEFAULT << 8)         /**< Shifted mode DEFAULT for DCDC_BSTEM23CTRL   */
#define DCDC_BSTEM23CTRL_DRVSPEED_DEFAULT_SETTING     (_DCDC_BSTEM23CTRL_DRVSPEED_DEFAULT_SETTING << 8) /**< Shifted mode DEFAULT_SETTING for DCDC_BSTEM23CTRL*/

